; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	image3 - mode
	spectrograph1 - mode
	infrared2 - mode
	thermograph4 - mode
	image5 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star9 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 image5)
	(supports instrument1 spectrograph1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared2)
	(supports instrument2 image5)
	(supports instrument2 image3)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
)
(:goal (and
	(have_image Star12 infrared0)
	(have_image Star13 infrared2)
	(have_image Star13 infrared0)
	(have_image Planet14 image3)
	(have_image Planet15 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation10 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 groundstation10)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation10)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 planet14 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet14)
   goals met: 0 of 5
5. (take_image satellite0 planet14 instrument0 image3)
   added: (have_image planet14 image3)
   goals met: 1 of 5
6. (turn_to satellite0 groundstation10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 5
7. (turn_to satellite0 star12 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star12)
   goals met: 1 of 5
8. (take_image satellite0 star12 instrument0 infrared0)
   added: (have_image star12 infrared0)
   goals met: 2 of 5
9. (turn_to satellite0 groundstation10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation10)
   goals met: 2 of 5
10. (turn_to satellite0 star13 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star13)
   goals met: 2 of 5
11. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 3 of 5
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 5
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 5
14. (turn_to satellite0 groundstation3 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 5
15. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 3 of 5
16. (turn_to satellite0 groundstation10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation10)
   goals met: 3 of 5
17. (turn_to satellite0 planet15 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet15)
   goals met: 3 of 5
18. (take_image satellite0 planet15 instrument1 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 4 of 5
19. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 5
20. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 5
21. (turn_to satellite0 star13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star13)
   goals met: 4 of 5
22. (turn_to satellite0 star5 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star5)
   goals met: 4 of 5
23. (calibrate satellite0 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 4 of 5
24. (turn_to satellite0 star13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star13)
   goals met: 4 of 5
25. (take_image satellite0 star13 instrument2 infrared2)
   added: (have_image star13 infrared2)
   goals met: 5 of 5
